
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Вариант = "СтатусОтправления" 	Тогда
		 		
		ПереченьСписка.Добавить("1","Новый");                  //CREATED
		ПереченьСписка.Добавить("2","Собран");                 //COLLECTED
		ПереченьСписка.Добавить("3","Отменен");                //REVOKED   
		ПереченьСписка.Добавить("4","Отменяется");             //REVOKING
		ПереченьСписка.Добавить("5","Выкуплен");               //FINISHED
		ПереченьСписка.Добавить("6","Спорный");                //CONTROVERSIAL
		ПереченьСписка.Добавить("7", "Сборка");                //COLLECTING  
		ПереченьСписка.Добавить("8", "В пути");                //DELIVERY
		ПереченьСписка.Добавить("9", "Отправлен");             //SEND
		ПереченьСписка.Добавить("10", "Возврат");              //REFUND
		ПереченьСписка.Добавить("11", "Готов к выдаче");       //READY_FOR_PICKUP
		ПереченьСписка.Добавить("12", "Забрать возврат");      //PICK_UP_REFUND
		ПереченьСписка.Добавить("13", "На сборке");            //PACKING 
		ПереченьСписка.Добавить("14", "Ожидает оплаты");       //PAYMENT_REQUIRED
		ПереченьСписка.Добавить("15", "Отменен покупателем");  //CANCELED
		ПереченьСписка.Добавить("16", "В закупке");            //WAITING_SUPPLY   
		
		
	ИначеЕсли Параметры.Вариант = "Маркетплейс" Тогда  
				 		
		//ПереченьСписка.Добавить("1","NONE");                  
		ПереченьСписка.Добавить("1","WILDBERRIES");                 
		ПереченьСписка.Добавить("2","OZON");                 
		ПереченьСписка.Добавить("3","YANDEX_MARKET");             
		ПереченьСписка.Добавить("4","FAMILIYA");              
		ПереченьСписка.Добавить("5","NATIONAL_CATALOG"); 
		ПереченьСписка.Добавить("6", "ALIE_EXPRESS");
		ПереченьСписка.Добавить("7", "OTHER");  
		ПереченьСписка.Добавить("8", "MOY_SKLAD");                
		ПереченьСписка.Добавить("9", "SBER_MEGA_MARKET");             
		ПереченьСписка.Добавить("10", "CISLINK");  
		ПереченьСписка.Добавить("11", "ONE_C");
		ПереченьСписка.Добавить("12", "AVITO");       
		ПереченьСписка.Добавить("13", "LEROY_MERLIN");      
		ПереченьСписка.Добавить("14", "DETMIR");            
		ПереченьСписка.Добавить("15", "KAZAN_EXPRESS");       
		//ПереченьСписка.Добавить("16", "EVOTOR");   
		
	ИначеЕсли Параметры.Вариант = "ВидОперацииЗК" 	Тогда
		
		ПереченьСписка.Добавить("1","Реализация");
		ПереченьСписка.Добавить("2","Передача на комиссию"); 
		
	КонецЕсли;
	
	Вариант = Параметры.Вариант; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыОтправленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗакрытияФормы = Новый Структура();
	ПараметрыЗакрытияФормы.Вставить("Вариант", Вариант);
	ПараметрыЗакрытияФормы.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока); 
	ПараметрыЗакрытияФормы.Вставить("ВыбранноеЗначение", Элемент.ТекущиеДанные.Представление);
	
	ОповеститьОВыборе(ПараметрыЗакрытияФормы);
	
КонецПроцедуры      



